DataProcessors/ЗагрузкаПоказанийВодыИзExcel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаПоказанийВодыИзExcel</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФайлЕксель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПапкаИзображений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерЛС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Власник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПрибора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Послуга</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Новый</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спожито</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗняття</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатКонтакта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прибор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фото</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Геолокация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Завантажил</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресИзображения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/УстановленныеПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>УстановленныеПриборыУчета</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднемесячноеПоказание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрибора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоказанияПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПриборовУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РезультатыПроверкиЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>РезультатыПроверкиЛицевыхСчетов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатКонтакта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Геолокация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завантажил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыТарифов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дневной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ночной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пиковый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Общий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИсточникиПоказаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ИсточникиПоказаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СайтЖКХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаблицаExcel</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оператор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РучнаяОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телеграм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Банк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктХолоднойВоды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктОтопление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ПриборыУчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тарифность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТарифностьСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРегистрацииПоказаний</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРегистрацииПоказанийСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрядность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщедомовойСчетчик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузкаПоказанийВодыИзExcel/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ФайлЕксельНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.ФайлЕксель;
	ДиалогОткрытияФайла.Фильтр = "Электронная таблица Excel(*.xlsx)|*.xlsx";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл';uk='Виберіть файл'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ФайлЕксель = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПапкаИзображенийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Каталог = Объект.ПапкаИзображений;
	Диалог.Заголовок = НСтр("ru='Выберите папку с изображениями';uk='Виберіть теку із зображеннями'");
	Если Диалог.Выбрать() Тогда
		Объект.ПапкаИзображений = Диалог.Каталог;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьИПроверить(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ФайлЕксель) Тогда
		Предупреждение(НСтр("ru='Укажите файл Excel.';uk='Вкажіть файл Excel.'"));
		Возврат;
	КонецЕсли;
	Если НЕ ПрочитатьФайлКлиент() Тогда
		Возврат;
	КонецЕсли;
	ПроверитьНаСервере();
	Сообщить(НСтр("ru='Файл прочитан и проверен.';uk='Файл прочитано та перевірено.'"));
КонецПроцедуры

&НаКлиенте
Функция ПрочитатьФайлКлиент()
	Объект.Данные.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.application");
	Исключение
		Предупреждение(НСтр("ru='Не удалось подключиться к Excel: ';uk='Не вдалося підключитися до Excel: '") + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	Попытка
		Excel.Workbooks.Open(Объект.ФайлЕксель);
		КоличествоСтрок = Excel.ActiveSheet.UsedRange.Rows.Count();
		Для Сч = 2 По КоличествоСтрок Цикл
			НС = Объект.Данные.Добавить();
			НС.НомерЛС           = СокрЛП(Строка(Excel.Cells(Сч, 1).Value));
			НС.Власник           = СокрЛП(Строка(Excel.Cells(Сч, 2).Value));
			НС.Адрес             = СокрЛП(Строка(Excel.Cells(Сч, 3).Value));
			НС.НомерПрибора      = СокрЛП(Строка(Excel.Cells(Сч, 4).Value));
			НС.Послуга           = СокрЛП(Строка(Excel.Cells(Сч, 5).Value));
			НС.Новый             = ЧислоИзЯчейки(Excel.Cells(Сч, 7).Value);
			НС.Спожито           = ЧислоИзЯчейки(Excel.Cells(Сч, 8).Value);
			НС.ДатаЗняття        = ДатаИзЯчейки(Excel.Cells(Сч, 9).Value);
			НС.Фото              = СокрЛП(Строка(Excel.Cells(Сч, 10).Value));
			НС.РезультатКонтакта = СокрЛП(Строка(Excel.Cells(Сч, 11).Value));
			НС.Геолокация        = СокрЛП(Строка(Excel.Cells(Сч, 12).Value));
			НС.Завантажил        = СокрЛП(Строка(Excel.Cells(Сч, 13).Value));
			Если НЕ ПустаяСтрока(Объект.ПапкаИзображений) И НЕ ПустаяСтрока(НС.Фото) Тогда
				НС.АдресИзображения = ПрочитатьИзображение(Объект.ПапкаИзображений, НС.Фото);
			КонецЕсли;
		КонецЦикла;
		Excel.Workbooks.Close();
		Excel.Quit();
	Исключение
		Попытка Excel.Quit(); Исключение КонецПопытки;
		Предупреждение(НСтр("ru='Ошибка чтения файла: ';uk='Помилка читання файлу: '") + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	Возврат Истина;
КонецФункции

&НаКлиенте
Функция ПрочитатьИзображение(Папка, ИмяФайла)
	Путь = Папка;
	Если Прав(Путь, 1) <> "\" И Прав(Путь, 1) <> "/" Тогда
		Путь = Путь + "\";
	КонецЕсли;
	Путь = Путь + ИмяФайла;
	Попытка
		ДвоичныеДанные = Новый ДвоичныеДанные(Путь);
		Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
	Исключение
		Возврат "";
	КонецПопытки;
КонецФункции

&НаКлиенте
Функция ЧислоИзЯчейки(Ячейка)
	Если Ячейка = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	Если ТипЗнч(Ячейка) = Тип("Число") Тогда
		Возврат Ячейка;
	КонецЕсли;
	Стр = СтрЗаменить(СокрЛП(Строка(Ячейка)), ",", ".");
	Стр = СтрЗаменить(Стр, " ", "");
	Если ПустаяСтрока(Стр) Тогда
		Возврат 0;
	КонецЕсли;
	Попытка
		Возврат Число(Стр);
	Исключение
		Возврат 0;
	КонецПопытки;
КонецФункции

&НаКлиенте
Функция ДатаИзЯчейки(Ячейка)
	Если Ячейка = Неопределено Тогда
		Возврат '00010101';
	КонецЕсли;
	Если ТипЗнч(Ячейка) = Тип("Дата") Тогда
		Возврат Ячейка;
	КонецЕсли;
	Если ТипЗнч(Ячейка) = Тип("Число") Тогда
		Возврат '18991230' + Ячейка * 86400;
	КонецЕсли;
	Стр = СокрЛП(Строка(Ячейка));
	Если ПустаяСтрока(Стр) Тогда
		Возврат '00010101';
	КонецЕсли;
	Стр = СтрЗаменить(Стр, "-", " ");
	Стр = СтрЗаменить(Стр, ":", " ");
	Стр = СтрЗаменить(Стр, "T", " ");
	Стр = СтрЗаменить(Стр, ".", " ");
	Части = Новый Массив;
	Для Каждого Ч Из СтрРазделить(Стр, " ", Ложь) Цикл
		Если НЕ ПустаяСтрока(Ч) Тогда
			Части.Добавить(Ч);
		КонецЕсли;
	КонецЦикла;
	Если Части.Количество() < 3 Тогда
		Возврат '00010101';
	КонецЕсли;
	А = Число(Части[0]);
	Б = Число(Части[1]);
	В = Число(Части[2]);
	Час = ?(Части.Количество() > 3, Число(Части[3]), 0);
	Хв  = ?(Части.Количество() > 4, Число(Части[4]), 0);
	Сек = ?(Части.Количество() > 5, Число(Части[5]), 0);
	Если А > 31 Тогда
		Год = А; Мес = Б; День = В;
	Иначе
		День = А; Мес = Б; Год = В;
	КонецЕсли;
	Попытка
		Возврат Дата(Год, Мес, День, Час, Хв, Сек);
	Исключение
		Возврат '00010101';
	КонецПопытки;
КонецФункции

&НаСервере
Процедура ПроверитьНаСервере()
	Для Каждого Стр Из Объект.Данные Цикл
		Стр.ЛицевойСчет = Справочники.ЛицевыеСчета.ПустаяСсылка();
		Стр.Прибор = Справочники.ПриборыУчета.ПустаяСсылка();
		Стр.ПредыдущиеПоказания = 0;

		ЛС = НайтиЛС(Стр.НомерЛС);
		Если НЕ ЗначениеЗаполнено(ЛС) Тогда
			Стр.Статус = "ЛС не знайдено";
			Продолжить;
		КонецЕсли;
		Стр.ЛицевойСчет = ЛС;

		Если НЕ ЗначениеЗаполнено(Стр.Новый) Тогда
			Стр.Статус = "Без показника" + ?(ПустаяСтрока(Стр.РезультатКонтакта), "", " (" + Стр.РезультатКонтакта + ")");
			Продолжить;
		КонецЕсли;

		Прибор = НайтиПрибор(ЛС, Стр.НомерПрибора);
		Если НЕ ЗначениеЗаполнено(Прибор) Тогда
			Стр.Статус = "Прилад не знайдено";
			Продолжить;
		КонецЕсли;
		Стр.Прибор = Прибор;
		Стр.ПредыдущиеПоказания = ПоследнийПоказательБазы(Прибор);

		Если Стр.Новый = 0 Тогда
			Стр.Статус = "Показник = 0 (буде пропущено)";
			Продолжить;
		КонецЕсли;

		Стр.Статус = "OK";
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция НайтиЛС(Номер)
	Если ПустаяСтрока(Номер) Тогда
		Возврат Справочники.ЛицевыеСчета.ПустаяСсылка();
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛицевыеСчета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	|ГДЕ
	|	ЛицевыеСчета.Наименование = &Номер
	|	И НЕ ЛицевыеСчета.ПометкаУдаления";
	Запрос.УстановитьПараметр("Номер", Номер);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.ЛицевыеСчета.ПустаяСсылка();
КонецФункции

&НаСервере
Функция НайтиПрибор(ЛС, Номер)
	Если ПустаяСтрока(Номер) Тогда
		Возврат Справочники.ПриборыУчета.ПустаяСсылка();
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПриборыУчета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПриборыУчета КАК ПриборыУчета
	|ГДЕ
	|	ПриборыУчета.ЗаводскойНомер = &Номер
	|	И НЕ ПриборыУчета.ПометкаУдаления
	|	И (ПриборыУчета.ЛицевойСчет = &ЛС
	|		ИЛИ ПриборыУчета.Ссылка В
	|			(ВЫБРАТЬ
	|				УстПУ.ПриборУчета
	|			ИЗ
	|				РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(, ОбъектУстановки = &ЛС) КАК УстПУ
	|			ГДЕ
	|				УстПУ.Действует))";
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.УстановитьПараметр("ЛС", ЛС);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.ПриборыУчета.ПустаяСсылка();
КонецФункции

&НаСервере
Функция ПоследнийПоказательБазы(Прибор)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(СП.Значение), 0) КАК Знач
	|ИЗ
	|	РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(, ПриборУчета = &Прибор) КАК СП";
	Запрос.УстановитьПараметр("Прибор", Прибор);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Знач;
	КонецЕсли;
	Возврат 0;
КонецФункции

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	Если Объект.Данные.Количество() = 0 Тогда
		Предупреждение(НСтр("ru='Сначала прочитайте файл.';uk='Спочатку прочитайте файл.'"));
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Предупреждение(НСтр("ru='Укажите организацию.';uk='Вкажіть організацію.'"));
		Возврат;
	КонецЕсли;
	Результат = СоздатьДокументыНаСервере();
	Сообщить(Результат);
КонецПроцедуры

&НаСервере
Функция СоздатьДокументыНаСервере()
	ПоЛС = Новый Соответствие;
	Для Каждого Стр Из Объект.Данные Цикл
		Если Стр.Статус <> "OK" Тогда
			Продолжить;
		КонецЕсли;
		Массив = ПоЛС.Получить(Стр.ЛицевойСчет);
		Если Массив = Неопределено Тогда
			Массив = Новый Массив;
			ПоЛС.Вставить(Стр.ЛицевойСчет, Массив);
		КонецЕсли;
		Массив.Добавить(Стр);
	КонецЦикла;

	СозданоДокументов = 0;
	СозданоСтрок = 0;
	ПомилокПроведения = 0;

	Для Каждого КлючЗначение Из ПоЛС Цикл
		ЛС = КлючЗначение.Ключ;
		Рядки = КлючЗначение.Значение;

		МаксДата = '00010101';
		Для Каждого Стр Из Рядки Цикл
			Если Стр.ДатаЗняття > МаксДата Тогда
				МаксДата = Стр.ДатаЗняття;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ЗначениеЗаполнено(МаксДата) Тогда
			МаксДата = ТекущаяДата();
		КонецЕсли;

		Док = Документы.ВводПоказанийПриборовВоды.СоздатьДокумент();
		Док.Дата = МаксДата;
		Док.Организация = Объект.Организация;
		Док.ЛицевойСчет = ЛС;
		Док.Здание = ЛС.Владелец;
		Док.ПериодНачисления = КонецМесяца(МаксДата);
		Попытка
			Док.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Исключение
		КонецПопытки;

		Услуги = Новый Массив;
		Для Каждого Стр Из Рядки Цикл
			НР = Док.ПриборыУчета.Добавить();
			НР.ПриборУчета = Стр.Прибор;
			НР.ПредыдущиеПоказания = Стр.ПредыдущиеПоказания;
			НР.ТекущиеПоказания = Стр.Новый;
			Расход = Стр.Новый - Стр.ПредыдущиеПоказания;
			НР.КвоКубов = ?(Расход >= 0, Расход, Стр.Спожито);
			НР.Услуга = Стр.Прибор.Услуга;
			НР.ВидТарифа = Перечисления.ВидыТарифов.Общий;
			НР.Источник = Перечисления.ИсточникиПоказаний.ТаблицаExcel;
			Если Услуги.Найти(НР.Услуга) = Неопределено Тогда
				Услуги.Добавить(НР.Услуга);
			КонецЕсли;
			СозданоСтрок = СозданоСтрок + 1;
		КонецЦикла;
		Если Услуги.Количество() = 1 Тогда
			Док.Услуга = Услуги[0];
		КонецЕсли;

		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			СозданоДокументов = СозданоДокументов + 1;
		Исключение
			Попытка
				Док.Записать();
			Исключение
			КонецПопытки;
			ПомилокПроведения = ПомилокПроведения + 1;
			Сообщить(СтрШаблон(НСтр("ru='ЛС %1: документ не проведён — %2';uk='ЛС %1: документ не проведено — %2'"),
				Строка(ЛС), ОписаниеОшибки()));
		КонецПопытки;
	КонецЦикла;

	// Запис результатів перевірки в регістр (по кожному рядку з визначеним ЛС)
	ЗаписейРегистра = 0;
	Для Каждого Стр Из Объект.Данные Цикл
		Если НЕ ЗначениеЗаполнено(Стр.ЛицевойСчет) Тогда
			Продолжить;
		КонецЕсли;
		ДатаЗ = ?(ЗначениеЗаполнено(Стр.ДатаЗняття), Стр.ДатаЗняття, ТекущаяДата());
		Запись = РегистрыСведений.РезультатыПроверкиЛицевыхСчетов.СоздатьМенеджерЗаписи();
		Запись.Период = ДатаЗ;
		Запись.ЛицевойСчет = Стр.ЛицевойСчет;
		Запись.Фото = Стр.Фото;
		Запись.РезультатКонтакта = Стр.РезультатКонтакта;
		Запись.Геолокация = Стр.Геолокация;
		Запись.Завантажил = Стр.Завантажил;
		Если НЕ ПустаяСтрока(Стр.АдресИзображения) Тогда
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(Стр.АдресИзображения);
			Если ДвоичныеДанные <> Неопределено Тогда
				Запись.Изображение = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных());
			КонецЕсли;
		КонецЕсли;
		Попытка
			Запись.Записать(Истина);
			ЗаписейРегистра = ЗаписейРегистра + 1;
		Исключение
		КонецПопытки;
	КонецЦикла;

	Возврат СтрШаблон(
		НСтр("ru='Создано документов: %1 (строк: %2). Ошибок проведения: %3. Записей в регистр: %4.';uk='Створено документів: %1 (рядків: %2). Помилок проведення: %3. Записів у регістр: %4.'"),
		СозданоДокументов, СозданоСтрок, ПомилокПроведения, ЗаписейРегистра);
КонецФункции
